import pandas as pd

print('----'*30)
print('Табель учащихся в средней школе')

studentCard = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Андрей','Сергей','Екатерина','Виктория','Мария'],
        'Фамилия': ['Петров','Анатольев','Литовененко','Мессинг','Пастернак'],
        'Дата рождения' : ['17.08.2000','04.05.2001','01.04.1999','23.02.2002','08.03.2004'],
        'Успеваемость' : ['Отличник','Троечник','Хорошист','Отличник','Хорошист']
}
    
sc = pd.DataFrame(data = studentCard)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
        cl.write('----'*30)
    
print(sc)
